app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "is_admin", "persistence_token", "email") VALUES('2009-08-23 16:57:25', '0a5a698efce3bd0b4c72834115aad827b813279db3a18485a8115c6f8e820eead6f7331a9490a923ae6235f6f0514858cf2a06f9865b9d01278e66595e82283e', '2009-08-23 16:57:25', 'eSG0Z0-5NGIrJxxZIbia', NULL, 'f22c539873af8f3ebfd6e7689d68dc72560e586d76859ec8b7c8f8194e35a235664e08a4a374ae04c1457a08d6da60b0d31b2bbf6e887a6eaa3ea69e7edac877', 'lisa@linowes.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    if is_admin? && params[:id]
      @user = User.find(params[:id])